interface ICategories {
  title: string
  description: string
  resources: Array<IResources>
  slug: string
}

interface IResources {
  title: string
  description?: string
  phone?: string
  website?: string
  other?: { url: string; label: string; newTab?: boolean }[]
}

export const categories: Array<ICategories> = [
  {
    title: 'خودکشی و خودآزاری',
    slug: 'suicide',
    description:
      'افکار خودکشی می‌تونه ترسناک و گیج­‌کننده باشه. اگر نگران خودتون یا یکی از اطرافیانتون هستین بهتره قبل از هر کاری با یک نفر صحبت کنین. همه‌ی سرویس‌ها رایگان هستند و هیچ درخواستی برای افشای هویت شما نمی‌کنند و تمامی اطلاعات و حرف‌های شما، محرمانه است',
    resources: [
      {
        title: 'خط ملی اورژانس اجتماعی',
        description:
          'شماره ۱۲۳ یک خط اضطراری اجتماعی که به صورت ۲۴ ساعته آماده حمایت و کمک به افرادی است که به شنیدن و همراهی نیاز دارند.',
        phone: '123',
      },
      {
        title: 'سامانه نوشتاری بحران',
        description:
          'یک سرویس ملی رایگان که ۲۴ ساعته به فارسی‌زبانانی که در شرایط بد عاطفی قرار دارند، مشاور بحران ارائه می‌دهد.',
        other: [
          {
            url: 'https://irancrisisline.org/get-help/text/',
            label: 'چت آنلاین',
          },
        ],
      },
      {
        title: 'مشاوره تلفنی بهزیستی',
        description:
          'شماره ۱۴۸۰، خط مشاوره رایگان سازمان بهزیستی، از ۸ صبح تا ۲۴ شب خدمات مشاوره در زمینه‌های مختلف را توسط متخصصان آموزش‌دیده ارائه می‌دهد.',
        phone: '1480',
      },
    ],
  },
  {
    title: 'خشونت خانگی و آزار فیزیکی',
    slug: 'violence',
    description:
      'اگر شما یا کسی که می‌شناسید قربانی خشونت خانگی یا آزار فیزیکی هستید، تنها نیستید. کمک در دسترس است و متخصصان آموزش‌دیده آماده‌اند تا به شما کمک کنند. تماس‌های شما محرمانه خواهد ماند.',
    resources: [
      {
        title: 'اورژانس اجتماعی - خشونت خانگی',
        description:
          'خط تلفن ۱۲۳ به صورت ۲۴ ساعته آماده کمک‌رسانی به قربانیان خشونت خانگی است. این خدمات شامل مشاوره، حمایت و در صورت نیاز اقدامات اضطراری می‌شود.',
        phone: '123',
      },
      {
        title: 'صدای یارا',
        description:
          'یک سازمان غیردولتی که به قربانیان خشونت خانگی کمک می‌کند و خدمات مشاوره حقوقی و روانشناسی ارائه می‌دهد.',
        phone: '02188531109',
        website: 'https://www.irsprc.org/',
      },
      {
        title: 'خانه امن',
        description:
          'سرپناه موقت برای زنان و کودکانی که قربانی خشونت خانگی هستند. برای دسترسی به این خدمات با اورژانس اجتماعی (۱۲۳) تماس بگیرید.',
        phone: '123',
      },
    ],
  },
  {
    title: 'اعتیاد و سوء مصرف مواد',
    slug: 'addiction',
    description:
      'اعتیاد و سوءمصرف مواد می‌تونه چالش‌های بزرگی رو به وجود بیاره. اگر شما یا فردی از نزدیکانتون با این مسئله روبرو هستین، صحبت کردن با یک مشاور تخصصی می‌تونه اولین قدم مؤثر باشه.',
    resources: [
      {
        title: 'خط ملی اعتیاد',
        description:
          'برای پیشگیری، راهنمایی در درمان اعتیاد و ارجاع به مراکز مجاز فعالیت می‌کند. ساعات تماس: هر روز، ۸ صبح تا ۸ شب.',
        phone: '09628',
      },
    ],
  },
  {
    title: 'بیماری‌های سخت درمان',
    slug: 'illness',
    description:
      'ممکنه که خودت یا یکی از عزیزانت بیماری‌های سخت درمانی داشته باشه. هنوز امید هست، ناراحت نباش. اینجا میتونی منابعی برای کمک به خودت و دیگران پیدا کنی.',
    resources: [
      {
        title: 'مراکز آزمایش رایگان ایدز و مشاوره بیماری های رفتاری',
        description: 'در این مراکز علاوه بر مشاوره، آزمایش ایدز و تشخیص HIV به صورت رایگان انجام می‌شود.',
        other: [
          {
            url: '/free-hiv-test-centers',
            label: 'مشاهده لیست مراکز',
            newTab: false,
          },
        ],
      },
      {
        title: 'زنان سرپرست خانوار مبتلا به ایدز',
        description:
          'سامانه تلفنی ۰۲۱۵۳۸۶۵ مربوط به سازمان مردم نهاد احیا است که بطور مشخص در زمینه پیشگیری و اطلاع­‌رسانی بیماری ایدز، توانمندسازی و حرفه­‌آموزی زنان سرپرست خانوار مبتلا به بیماری ایدز فعالیت می­‌کند. ساعات تماس: شنبه تا چهارشنبه ۸ صبح تا ۱۷ عصر',
        phone: '02153865',
      },
    ],
  },
  {
    title: 'عمومی',
    slug: 'general',
    description:
      'ممکنه که خودت یا یکی از عزیزانت بیماری‌های سخت درمانی داشته باشه. هنوز امید هست، ناراحت نباش. اینجا میتونی منابعی برای کمک به خودت و دیگران پیدا کنی.',
    resources: [
      {
        title: 'پلیس',
        phone: '110',
      },
      {
        title: 'اورژانس',
        phone: '115',
      },
      {
        title: 'آتش نشانی',
        phone: '125',
      },
      {
        title: 'هلال احمر',
        phone: '112',
      },
    ],
  },
]
