interface TestCenter {
  city: string
  address: string
  phoneNumbers: string[]
}

export const testCenters: TestCenter[] = [
  { city: 'آبادان', address: 'منطقه امیری، مرکز بهداشتی درمانی ۵ مهر', phoneNumbers: ['06153323577'] },
  { city: 'آبدانان (ایلام)', address: 'مرکز بهداشتی درمانی شماره ۲', phoneNumbers: ['08433622017'] },
  { city: 'آستارا', address: 'فلکه بیمارستان، مرکز شهید محمد زاده، طبقه سوم اورژانس', phoneNumbers: ['01344817370'] },
  {
    city: 'آمل',
    address: 'خیابان شیخ فضل الله نوری، مرکز بهداشتی درمانی شیخ فضل الله نوری',
    phoneNumbers: ['01144291740'],
  },
  {
    city: 'اراک',
    address: 'ابتدای خیابان قائم مقام، خیابان سیدالشهدا، خیابان لاله، پشت پارک آزادی',
    phoneNumbers: ['08632266891'],
  },
  {
    city: 'اردبیل',
    address: 'خیابان امام (ره)، پشت پیش دانشگاهی شهید مدرس، مرکز بهداشتی - درمانی رازی',
    phoneNumbers: ['04533261700'],
  },
  { city: 'ارومیه', address: 'خیابان کاشانی، مرکز بهداشتی درمانی شماره ۶، طبقه میانی', phoneNumbers: ['04434460853'] },
  { city: 'اسلام آباد', address: 'مرکز بهداشتی درمانی شماره ۲', phoneNumbers: ['08345232428'] },
  {
    city: 'اسلامشهر',
    address: 'انتهای خیابان امام محمد باقر(ع)، شهرک انبیا، جنب مرکز بهداشتی درمانی الغدیر',
    phoneNumbers: ['02156831219'],
  },
  {
    city: 'اصفهان',
    address: 'فلکه احمد آباد، خیابان بزرگمهر، مرکز بهداشتی درمانی شهید نواب صفوی',
    phoneNumbers: ['03132275250'],
  },
  {
    city: 'اندیمشک (اهواز)',
    address: 'تقاطع طالقانی، خیابان سینا رووبه روی تامین اجتماعی، درمانگاه دکتر خیرالهی',
    phoneNumbers: ['06142622405'],
  },
  { city: 'انزلی', address: 'غازیان، خیابان طالقانی، مرکز بهداشتی درمانی غازیان', phoneNumbers: ['01344440101'] },
  {
    city: 'اهواز',
    address: 'زیتون کارمندی، خیابان زاویه، جنب بیمارستان ابوذر، مرکز مشاوره بیماری‌های رفتاری',
    phoneNumbers: ['06134445027', '06134454600'],
  },
  { city: 'ایرانشهر (سیستان و بلوچستان)', address: 'فلکه خاش، مرکز ۱ شهری', phoneNumbers: ['05437223294'] },
  { city: 'ایلام', address: 'بالاتر از میدان مقاومت، ابتدای بلوار جمهوری', phoneNumbers: ['08433369476'] },
  { city: 'بابل', address: 'خیابان مدرس، جنب کانون امام خمینی، مرکز بهداشتی ۲۲ بهمن', phoneNumbers: ['01132207689'] },
  { city: 'بجنورد', address: 'خیابان چمران، خیابان حر', phoneNumbers: ['05832233440'] },
  { city: 'بروجرد', address: 'میدان امام حسین، ابتدای بلوار شهید آیت', phoneNumbers: ['06642463868'] },
  {
    city: 'بم',
    address: 'میدان سرداران، بلوار شهید رجایی، سایت اداری ساختمان مرکز بهداشت',
    phoneNumbers: ['034444254501'],
  },
  { city: 'بندرعباس', address: 'بلوار جمهوری اسلامی، روبه‌روی بیمارستان شهید محمدی', phoneNumbers: ['07633354308'] },
  { city: 'بهارستان', address: 'سلطان آباد، مرکز مشاوره بیماری‌های رفتاری شهید صبوری', phoneNumbers: ['02156334646'] },
  {
    city: 'بهبهان (خوزستان)',
    address: 'فلکه بانک ملی، خیابان شهید نهایی، جنب داروخانه شبانه روزی، طبقه بالا',
    phoneNumbers: ['06152731070'],
  },
  {
    city: 'بوشهر',
    address: 'خیابان امام خمینی، جنب مرکز بهداشتی درمانی هفتم تیر، طبقه سوم',
    phoneNumbers: ['07733325927'],
  },
  {
    city: 'بوکان (آذربایجان غربی)',
    address: 'کمربندی، ابتدای خیابان سردار عزیز خان مکری، ستاد مرکز بهداشت شهرستان',
    phoneNumbers: ['04445265949'],
  },
  { city: 'بیجار (کردستان)', address: 'پشت قلعه، مرکز بهداشتی درمانی شماره ۳', phoneNumbers: ['08738236077'] },
  {
    city: 'بیرجند',
    address: 'سجاد شهر، بلوار غدیر، جنب آزمایشگاه مکانیک خاک، مرکز بهداشتی درمانی شماره ۴',
    phoneNumbers: ['05632414380'],
  },
  {
    city: 'تبریز',
    address: 'خیابان بهار، رو به روی پارک بانوان، مرکز تست رایگان ایدز در تبریز',
    phoneNumbers: ['04132829434'],
  },
  {
    city: 'تربت حیدریه (خراسان رضوی)',
    address: 'خیابان مدرس، مدرس ۱۲، مرکز بهداشتی درمانی امام خمینی (ره)',
    phoneNumbers: ['05152238581'],
  },
  {
    city: 'تنکابن (مازندران)',
    address: 'خیابان امام خمینی، کوچه شهید مروتی، مرکز بهداشتی درمانی شماره ۱',
    phoneNumbers: ['01154210590'],
  },
  { city: 'تهران', address: 'انتهای بلوار کشاورز، بیمارستان امام خمینی، جنب بخش عفونی', phoneNumbers: ['02166911296'] },
  {
    city: 'تهران',
    address:
      'خیابان قلعه مرغی، خیابان زمزم، کوچه باغ، مرکز مشاوه بیماری‌های رفتاری زمزم، جنب مرکز بهداشتی درمانی شهید احمدی',
    phoneNumbers: ['02155841222'],
  },
  {
    city: 'تهران - شرق',
    address:
      'خیابان دماوند، بعد از میدان امام حسین، خیابان شهید منتظری، انتهای بلوار اسدی، پشت بیمارستان بوعلی، مرکز مشاوره بوعلی',
    phoneNumbers: ['02133337000'],
  },
  {
    city: 'تهران - شمال شرق',
    address: 'خیابان رسالت، خیابان کرمان جنوبی، کوچه زرین قبایی، درمانگاه دگمه چی',
    phoneNumbers: ['02122303792', '02122525140'],
  },
  {
    city: 'تهران - شمیرانات',
    address: 'میدان تجریش، ابتدای خیابان شریعتی، درمانگاه طالقانی',
    phoneNumbers: ['02122688000'],
  },
  {
    city: 'تهران - غرب',
    address: 'خیابان آزادی، بلوار استاد معین، خیابان شهید دستغیب غربی، مرکز مشاوره بیماری‌های رفتاری والفجر',
    phoneNumbers: ['02166038920', '02166038921'],
  },
  {
    city: 'جهرم (شیراز)',
    address: 'چهار راه حافظ، ابتدای بلوار حافظ، مرکز مشاوره امید',
    phoneNumbers: ['07154343004'],
  },
  {
    city: 'جیرفت (کرمان)',
    address: 'مرکز بهداشتی درمانی شماره ۱، خیابان شفا، جنب بیمارستان امام خمینی',
    phoneNumbers: ['03443310651'],
  },
  {
    city: 'چابهار (سیستان و بلوچستان)',
    address: 'بلوار امام خمینی جنب مسجد جامع اهل سنت، مرکز ۴ شهری',
    phoneNumbers: ['05435338400'],
  },
  {
    city: 'خاش (سیستان و بلوچستان)',
    address: 'خیابان انقلاب، مرکز شماره ۳ بهداشتی درمانی',
    phoneNumbers: ['05433728199'],
  },
  {
    city: 'خرم آباد',
    address: 'بلوار ولایت، دره گرم، جنب نگارستان ۱۷، ساختمان سابق مرکز بهداشت',
    phoneNumbers: ['06633232171'],
  },
  { city: 'خرمشهر', address: 'بلوار خلیج فارس، مرکز بهداشتی درمانی آیت اله طالقانی', phoneNumbers: ['06153523711'] },
  {
    city: 'خوی (آذربایجان غربی)',
    address: 'بلوار ۱۵ خرداد، میدان شهید فهمیده، جنب پارک مریم، مرکز بهیاری سابق',
    phoneNumbers: ['04446234063'],
  },
  { city: 'دزفول', address: 'میدان شهید بهشتی (افشار)، رو به روی بیمارستان افشار', phoneNumbers: ['06142231077'] },
  { city: 'دشتستان (بوشهر)', address: 'برازجان، بلوار خضر، مرکز بهداشت قدیم', phoneNumbers: ['07734229949'] },
  { city: 'دهلران (ایلام)', address: 'مرکز بهداشتی - درمانی شماره ۱', phoneNumbers: ['08433721100'] },
  {
    city: 'رباط کریم (تهران)',
    address: 'انتهای خیابان مصلی، بلوار شهید کمالی، مرکز شهید شاطریان',
    phoneNumbers: ['02156423364'],
  },
  { city: 'رشت', address: 'بیستو، چمارسرا، جنب پمپ بنزین مرکز شماره ۱۰', phoneNumbers: ['01333559501'] },
  {
    city: 'رفسنجان (کرمان)',
    address: 'خیابان امام، مرکز شماره یک بهداشتی',
    phoneNumbers: ['03434289232', '03434285152'],
  },
  { city: 'رودان (هرمزگان)', address: 'میدان جمهوری اسلامی، جنب حوزه نظام وظیفه', phoneNumbers: ['07642882188'] },
  { city: 'زابل', address: 'خ هیرمند، هیرمند ۲', phoneNumbers: ['05432281100'] },
  { city: 'زاهدان', address: 'خیابان مدرس، نبش مدرس ۹، مرکز مشاوره بیماری‌های رفتاری', phoneNumbers: ['05433437138'] },
  { city: 'زنجان', address: 'خیابان جمهوری اسلامی، جنب خیابان نهم، اعتمادیه', phoneNumbers: ['02433423774'] },
  { city: 'زهک (سیستان و بلوچستان)', address: 'بلوار ۲۲ بهمن، کمپ آبیاری', phoneNumbers: ['054332615140'] },
  { city: 'ساری', address: 'خیابان امیرمازندرانی، شهبند', phoneNumbers: ['01133393501'] },
  {
    city: 'ساوجبلاغ (البرز)',
    address: 'هشتگرد، خیابان امام خمینی، رو به روی بانک تجارت، مرکز بهداشتی درمانی شهید کلیم اله معدندار',
    phoneNumbers: ['02644237808'],
  },
  {
    city: 'ساوه (مرکزی)',
    address: 'خیابان شریعتی، مرکز بهداشتی درمانی مصطفی خمینی، طبقه سوم',
    phoneNumbers: ['08642237817'],
  },
  {
    city: 'سبزوار (خراسان)',
    address: 'خیابان طالقانی، رو به روی حسینیه نجم، مرکز بهداشت شهرستان',
    phoneNumbers: ['05144658200'],
  },
  {
    city: 'سراوان (سیستان و بلوچستان)',
    address: 'خیابان بهشتی ۴، مرکز مشاوره سل و ایدز',
    phoneNumbers: ['05437629600'],
  },
  {
    city: 'سرباز (سیستان و بلوچستان)',
    address: 'خیابان امام خمینی، جنب مسجد جامع اهل سنت، مرکز ۴ شهری',
    phoneNumbers: ['05435338400'],
  },
  {
    city: 'سرباز (سیستان و بلوچستان)',
    address: 'خیابان امام خمینی، مرکز بهداشت شهرستان، مرکز بهداشتی درمانی راسک',
    phoneNumbers: ['05437142729'],
  },
  {
    city: 'سقز (کردستان)',
    address: 'میدان استقلال، رو به روی کمیته امداد امام خمینی (ره)',
    phoneNumbers: ['08736227170'],
  },
  {
    city: 'سمنان',
    address: 'خیابان شهید رجایی، کوچه شهید رحیمی ، جنب فروشگاه دانشگاه (تدین)',
    phoneNumbers: ['02333321361'],
  },
  { city: 'سنندج', address: 'سه راه شریف آباد، جنب سازمان انتقال خون', phoneNumbers: ['08733239210'] },
  {
    city: 'سیرجان (کرمان)',
    address: 'بلوار دکتر صادقی، رو به روی پارک ۱۷ شهریور، جنب مرکز سید الشهدا',
    phoneNumbers: ['03442238403', '03442204022'],
  },
  { city: 'شاهرود', address: 'خیابان فردوسی، مرکز بهداشت شهرستان، طبقه همکف', phoneNumbers: ['02332220061'] },
  {
    city: 'شهر ری',
    address:
      'شهر ری، خیابان شهید رجایی، سیزده آبان، خیابان شهید رشیدی، بعد از ورزشگاه، جنب مرکز بهداشتی - درمانی عظیم آباد',
    phoneNumbers: ['02155008222'],
  },
  { city: 'شهرکرد', address: 'خیابان ملت نرسیده به میدان انقلاب', phoneNumbers: ['03832260470'] },
  {
    city: 'شهریار',
    address: 'خیابان آهنگران، شبکه بهداشت و درمان قدیم، مرکز مشاوره شهریار',
    phoneNumbers: ['02162563800'],
  },
  {
    city: 'شوشتر (خوزستان)',
    address: 'دروازه، فلکه فخاریان، مرکز بهداشتی درمانی شماره ۳',
    phoneNumbers: ['06136247560'],
  },
  {
    city: 'شیراز',
    address: 'فلکه خاتون، بلوار دلاوران بسیج، خیابان لاوان، مرکز بهداشت حسین ابن علی',
    phoneNumbers: ['07137363000'],
  },
  { city: 'فردوس (خراسان جنوبی)', address: 'خیابان خرمشهر، جنب ستاد مرکز بهداشت', phoneNumbers: ['05632728850'] },
  {
    city: 'فسا (شیراز)',
    address: 'خیابان امام خمینی (ره)، مرکز بهداشتی درمانی شماره ۱',
    phoneNumbers: ['07153356800'],
  },
  { city: 'قروه (کردستان)', address: 'چهار راه مدرس، مرکز بهداشتی درمانی شماره ۴', phoneNumbers: ['08735248555'] },
  {
    city: 'قزوین',
    address: 'انتهای خیابان دانشگاه، بعد از کانال آب، مرکز بهداشت شهید بلندیان',
    phoneNumbers: ['02833669015'],
  },
  { city: 'قشم', address: 'میدان شهدای گمنام', phoneNumbers: ['07635222763'] },
  {
    city: 'قم',
    address: 'انتهای نیروگاه، رو به روی امامزاده سید معصوم، جنب مرکز بهداشتی درمانی الزهرا',
    phoneNumbers: ['02538618700'],
  },
  {
    city: 'کاشان',
    address: 'میدان امام خمینی، خیابان امام خمینی (ره)، مرکز بهداشتی درمانی گلابچی',
    phoneNumbers: ['03155463344'],
  },
  {
    city: 'کامیاران (کردستان)',
    address: 'شهرک الهیه، رو به روی پارک معلم، مرکز بهداشتی درمانی شماره ۳',
    phoneNumbers: ['08735522833'],
  },
  {
    city: 'کرج',
    address:
      'میدان آزادگان، ابتدای خیابان ۴۵ متری کاج (عظیمیه)، ابتدای خیابان تختی، مرکز بهداشتی درمانی شهید سبزه پرور',
    phoneNumbers: ['02632522415'],
  },
  {
    city: 'کرمان',
    address: 'خیابان شهید مطهری (احمدی غربی)، نرسیده به پل ۹ دی، رو به روی کوچه ۲۵',
    phoneNumbers: ['03432231982', '03432220404'],
  },
  {
    city: 'کرمانشاه',
    address: 'میدان رفعتیه (فاطمیه) - مرکز بهداشتی درمانی رفعتیه (مرکز تست ایدز در کرمانشاه)',
    phoneNumbers: ['08337274623', '08337231414'],
  },
  { city: 'کنارک (سیستان و بلوچستان)', address: 'مرکز بهداشتی شماره ۲', phoneNumbers: ['05435382626'] },
  {
    city: 'کهکیلویه و بویر احمد',
    address: 'جاده سوق، پشت هلال احمر، ساختمان شبکه بهداشت و درمان قدیم',
    phoneNumbers: ['07432262708'],
  },
  {
    city: 'کیش',
    address: 'بلوار خاتم الانبیا، خیابان اقبال، مرکز بهداشتی درمانی بوعلی',
    phoneNumbers: ['07644432626'],
  },
  {
    city: 'گچساران (کهکیلویه و بویر احمد)',
    address: 'خیابان شهید بلادیان، جنب مرکز بهداشتی درمانی شهید بشارت (مرکز شماره ۲)',
    phoneNumbers: ['07422226641'],
  },
  {
    city: 'گرگان',
    address: 'میدان شهرداری، کوچه لاله یکم، مرکز مشاوره بیماری‌های رفتاری',
    phoneNumbers: ['01732230506'],
  },
  { city: 'گناباد (خراسان رضوی)', address: 'میدان الغدیر', phoneNumbers: ['05157223378'] },
  {
    city: 'لاهیجان (گیلان)',
    address: 'خیابان امام خمینی، جنب بنیاد مسکن، شبکه بهداشت و درمان طبقه اول',
    phoneNumbers: ['01342231001'],
  },
  {
    city: 'مراغه (آذربایجان شرقی)',
    address: 'خیابان معلم شمالی، کوی دانش، طبقه فوقانی مرکز بهداشتی - درمانی شماره یک هاشم آباد',
    phoneNumbers: ['04137250228'],
  },
  {
    city: 'مشگین شهر (اردبیل)',
    address: 'خیابان سعدی (جاده موئیل) بالاتر از ثبت احوال، مرکز شماره ۳ شهری',
    phoneNumbers: ['04533536516'],
  },
  {
    city: 'مشهد',
    address: 'پنجراه، ابتدای بلوار وحدت، جنب پارک وحدت، مرکز مشاوره نوید تندرستی (مرکز تست ایدز در مشهد)',
    phoneNumbers: ['05133657731'],
  },
  {
    city: 'ملایر (همدان)',
    address: 'خیابان شهید احمد وفائی (بروجرد)، خیابان طالقانی، خیابان امام رضا، بن بست امام رضا',
    phoneNumbers: ['08132222300'],
  },
  {
    city: 'مهاباد (آذربایجان غربی)',
    address: 'چهار راه آزادی، مرکز بهداشتی - درمانی صلاح الدین ایوبی',
    phoneNumbers: ['04442222364'],
  },
  { city: 'میاندواب (آذربایجان غربی)', address: 'خیابان دانش، مرکز بهداشتی - درمانی ۵', phoneNumbers: ['04436456990'] },
  { city: 'میانه (آذربایجان شرقی)', address: 'خیابان امام خمینی، کلینیک الزهرا', phoneNumbers: ['04152234688'] },
  {
    city: 'میناب (هرمزگان)',
    address: 'بلوار امام خمینی، نرسیده به شهرداری، جنب انتقال خون',
    phoneNumbers: ['07642223490'],
  },
  {
    city: 'نیکشهر (سیستان و بلوچستان)',
    address: 'خیابان بهداشت، مرکز بهداشت واحد بیماری‌ها',
    phoneNumbers: ['05435222407'],
  },
  { city: 'هرسین (کرمانشاه)', address: 'چهار راه انقلاب، مرکز بهداشتی درمانی شماره ۲', phoneNumbers: ['08345125003'] },
  { city: 'همدان', address: 'ابتدای خیابان تختی، مرکز بهداشتی درمانی شهدا', phoneNumbers: ['08132521411'] },
  {
    city: 'ورامین',
    address: 'روبروی شبکه بهداشت و درمان ورامین، جنب پایگاه بهداشتی درمانی ورامین',
    phoneNumbers: ['02136280039'],
  },
  {
    city: 'یاسوج',
    address: 'خیابان دستجردی، مرکز بهداشت شهید دامیده، شهرستان بویراحمد',
    phoneNumbers: ['07433223701'],
  },
  {
    city: 'یزد',
    address: 'بلوار امام جعفر صادق، رو به روی فروشگاه زنجیره‌ای رفاه، جنب مسجد مهدیه، درمانگاه شهید نصیری',
    phoneNumbers: ['03536241444'],
  },
]
